In [2]:
a=5
b=5
print(a+b)
print(a-b)
print(a*b)
print(a/b)

10
0
25
1.0

In [3]:
a=6
b=5
c=3.5

print(a+b)

11

In [4]:
a=(1,6)
type=(a)

In [5]:
b={"asd": 10}
type=(b)

In [6]:
print(True and True)

True

In [7]:
print(True and False)

False

In [8]:
print(not True)

False

In [9]:
print(True or False)

True

In [10]:
input_ = "This is a test string to test the candidate"
resulting = "This a test string to test the candidate"

print(input_[:4]+ input_[7:])
print(input)

This a test string to test the candidate
<bound method Kernel.raw_input of <ipykernel.ipkernel.IPythonKernel object at 0x000001C9C21F0F70>>

In [11]:
input_[5:7]

'is'

In [12]:
input_ = "This is a test string to test the candidate"
resulting = "This a test string to test the candidate"
print(input_.find(" is"))
print(len(input_))

4
43

In [13]:
input_ = "This is a test string to test the candidate"
resulting = "This a test string to test the candidate"

a=input_[:input_.find(" is")]
b=input_[input_.find(" is ")+len(" is "):]
c=[a+' '+b]
print(c)

['This a test string to test the candidate']

In [14]:
input_.find(" is ")

4

In [15]:
input_[:input_.find(" is ")]

'This'

In [16]:
input = "This is a test string to test the candidate"

index = input.find("is")
if index != -1:
    output = input[:index] + input[index + len(" is"):]
    print(output)

This a test string to test the candidate

In [17]:
test_lidt = [1, 3, 4]
element = 4
tmp = 0
idx = -1
for i in test_lidt:
    if i == element:
        idx = tmp
    else:
        tmp += 1
if idx == -1:
    print("Not found")
else:
    print(f"Found at {idx}")

Found at 2

In [18]:
x=int(input())
print(x)
type(x)

TypeError: 'str' object is not callable

In [ ]:
input_ = "This is a test string to test the candidate"

input_.find(" is")
" ".join(input_.split(" is"))

'This  a test string to test the candidate'

In [ ]:
input="test for the whole class"
output="test for the entire class"


a=input[:input.find("whole")]
b=input[input.find("whole")+len("whole"):]
print(a)
print(b)
c=a+"entire"+b
print(c)

test for the
 class
test for the entire class

In [ ]:
a=[1,2,3]
b=a
b[0]=5
print(a)

[5, 2, 3]

In [ ]:
not True or False

False

In [ ]:
input_ = "test for the whole class"
output_ = input_.replace("whole", "entire")
print(output_)

test for the entire class

In [ ]:
enter_sequence=[1,2,3]
flag=0
print(f"enter_sequence:{enter_sequence}")
if flag==0:
    status=enter_sequence[::-1]
    print(f"status:{status}")
    flag=1
    if flag ==1:
        exit_sequence= enter_sequence
        print(f"exit_sequence:{exit_sequence}")

enter_sequence:[1, 2, 3]
status:[3, 2, 1]
exit_sequence:[1, 2, 3]

In [ ]:
elements=[1,2,3,4,[6,7,8],"hi how are you"]
for i in elements:
    print(i)

1
2
3
4
[6, 7, 8]
hi how are you

In [ ]:
elements=[1,2,3,4,[6,7,8],"hi how are you"]
capacity=3
current_quantity=0

while True:
    current_quantity+=1
    print(elements)
    if capacity <len(elements):

        break

[1, 2, 3, 4, [6, 7, 8], 'hi how are you']

while loop practice

In [ ]:
count=1
while count <= 5:
    print("hello")
    count+=1

hello
hello
hello
hello
hello

In [ ]:
i=1
while i <=5:
    print(i)
    i+=1

1
2
3
4
5

In [ ]:
i=5
while i>=1:
    print(i)
    i-=1

5
4
3
2
1

In [ ]:
#print numbers from 1 to 100 
i=1
while i <=100:
    print(i)
    i+=1

1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100

In [ ]:
# print numbers from 100 to 1

i=100
while i>=1:
    print(i)
    i-=1

100
99
98
97
96
95
94
93
92
91
90
89
88
87
86
85
84
83
82
81
80
79
78
77
76
75
74
73
72
71
70
69
68
67
66
65
64
63
62
61
60
59
58
57
56
55
54
53
52
51
50
49
48
47
46
45
44
43
42
41
40
39
38
37
36
35
34
33
32
31
30
29
28
27
26
25
24
23
22
21
20
19
18
17
16
15
14
13
12
11
10
9
8
7
6
5
4
3
2
1

In [ ]:
#print the multiplication table of number n.
n=int(input("enter the number : "))
i=1
while i <=  10:
    print(n*i)
    i+=1

4
8
12
16
20
24
28
32
36
40

In [ ]:
#print the element of the follwing list using a loop 
nums= [1,4,9,16,25,36,49,64,81,100]
idx=0
while idx < len(nums):
    print(nums[idx])
    idx+=1

1
4
9
16
25
36
49
64
81
100

In [ ]:
#search for a numbers x in this tuple using loop 
nums= (1,4,9,16,25,36,49,64,81,100)
x=64
i=0
while i < len(nums):
    if (nums[i]==x):
        print(" found at idx ",i)
    else:
        print("finding")
    i+=1

finding
finding
finding
finding
finding
finding
finding
 found at idx  7
finding
finding

In [ ]:
#break
i=1
while i <= 5:
    print("found at idx ",i)
    if (i ==3 ):
        break
    i +=1

found at idx  1
found at idx  2
found at idx  3

In [ ]:
#continue 

i =1
while i <=5:
    if (i==3):
        i+=1
        continue
    print(i)
    i+=1

1
2
4
5

In [ ]:
# for odd & even numbers. 
i =1
while i <= 10:
  if(i%2 == 0): #for even (i%2 !=0)(!=not) 
    i +=1
    continue  # skip 
print(i)
i +=1

KeyboardInterrupt:

For loop practice

In [ ]:
num= [1,2,3,4,5]

for val in num :
    print(val)

1
2
3
4
5

In [ ]:
# print the elements of the follwing lsit.
nums= [1,4,9,16,25,36,49,64,81,100]

for i in nums :
    print(i)

1
4
9
16
25
36
49
64
81
100

In [ ]:
nums= (1,4,9,16,25,36,49,64,81,100,36)
x=36
idx=0
for i in nums:
    if (i==x):
         print("number found at idx ", idx)
    idx +=1

number found at idx  5
number found at idx  10

In [ ]:
list=[]
for i in range(3000000):
  list.append(i)

In [ ]:
import numpy as np

In [ ]:

arr = np.array([1,2,3])
print(arr)

[1 2 3]

In [ ]:
a = np.array(["this is ball"])
np.char.find(a,"ball", start=0, end=None)

array([8])

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("C:\\Users\\Administrator\\Downloads\\archive\\austrian_airlines_reviews.csv")
df

,Unnamed: 0,Date Published,Rating,Max Rating,Title,Author,Country,Date,Review Body,Type Of Traveller,Seat Type,Route,Date Flown,Recommended,Aircraft,Verified
0,0,2024-03-05,1.0,10.0,"""poor ability to communicate policy""",Kristina Gollinger,United States,2024-03-05,The flight was never taken. My review that I...,Family Leisure,Economy Class,Los Angeles to Vienna,May 2023,no,NaN,1.0
1,1,2024-02-28,2.0,10.0,“Austrian dropped the ball”,E Kemp,United States,2024-02-28,I just returned from a 2 weeks trip in Europe...,Solo Leisure,Business Class,Vienna to Paris CDG,February 2024,no,NaN,1.0
2,2,2024-01-16,1.0,10.0,"""an arduous experience""",Sonia Ashrafpour,Switzerland,2024-01-16,My experience was far from satisfactory. The...,Couple Leisure,Economy Class,Vienna to Bangkok,December 2023,no,NaN,1.0
3,3,2024-01-12,8.0,10.0,"""professional and polite cabin crew""",Karim Fahim,Czech Republic,2024-01-12,"Austrian Airlines are really nice, decent ca...",Solo Leisure,Economy Class,Prague to Cairo via Vienna,December 2023,NaN,NaN,1.0
4,4,2024-01-09,3.0,10.0,“No apology whatsoever”,Thomas Wenn,United Kingdom,2024-01-09,This airline didn't load my baggage onto my o...,Solo Leisure,Economy Class,Bangkok to London Heathrow via Vienna,December 2023,no,NaN,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
742,742,2011-11-23,9.0,10.0,Austrian Airlines customer review,Tim Pfister,United States,2011-11-23,I routinely commute between Vienna and New Yor...,NaN,Economy Class,NaN,NaN,NaN,NaN,NaN
743,743,2011-11-22,3.0,10.0,Austrian Airlines customer review,E McCall,Canada,2011-11-22,Toronto-Vienna and Prague-Vienna-Toronto. Depa...,NaN,Economy Class,NaN,NaN,no,NaN,NaN
744,744,2011-11-22,7.0,10.0,Austrian Airlines customer review,D Rafael,Austria,2011-11-22,AMS-VIE. Had an extremely cheap ticket so wasn...,NaN,Economy Class,NaN,NaN,NaN,NaN,NaN
745,745,2011-11-11,8.0,10.0,Austrian Airlines customer review,O Müller,Switzerland,2011-11-11,ZRH-VIE-SOF-VIE first and last leg on A320 VIE...,NaN,Economy Class,NaN,NaN,NaN,NaN,NaN
746,746,2011-11-01,7.0,10.0,Austrian Airlines customer review,Nattawat Krittayanawat,Thailand,2011-11-01,BKK-VIE-PRG. If you don't mind a narrow and un...,NaN,Economy Class,NaN,NaN,NaN,NaN,NaN

In [7]:
import numpy as np
import pandas as pd

In [ ]:
df['Country']

0       United States
1       United States
2         Switzerland
3      Czech Republic
4      United Kingdom
            ...
742     United States
743            Canada
744           Austria
745       Switzerland
746          Thailand
Name: Country, Length: 747, dtype: object

In [ ]:
count = df['Country'].value_counts()
highestcount = count.idxmax()
print(highestcount)
df[df['Country'] == highestcount]

United States

,Unnamed: 0,Date Published,Rating,Max Rating,Title,Author,Country,Date,Review Body,Type Of Traveller,Seat Type,Route,Date Flown,Recommended,Aircraft,Verified
0,0,2024-03-05,1.0,10.0,"""poor ability to communicate policy""",Kristina Gollinger,United States,2024-03-05,The flight was never taken. My review that I...,Family Leisure,Economy Class,Los Angeles to Vienna,May 2023,no,NaN,1.0
1,1,2024-02-28,2.0,10.0,“Austrian dropped the ball”,E Kemp,United States,2024-02-28,I just returned from a 2 weeks trip in Europe...,Solo Leisure,Business Class,Vienna to Paris CDG,February 2024,no,NaN,1.0
6,6,2023-12-20,2.0,10.0,"""lost my 2 luggage for 10 days""",F Klee,United States,2023-12-20,"I always loved this airline but this time, t...",Family Leisure,Economy Class,Chicago to Skopje via Vienna,July 2023,no,NaN,1.0
7,7,2023-12-17,1.0,10.0,"""never fly Austrian airlines again""",S Hayne,United States,2023-12-17,I had an economy flight from Vienna to Frank...,Solo Leisure,Economy Class,Vienna to Frankfurt,December 2023,no,NaN,1.0
8,8,2023-12-09,1.0,10.0,"""Worst airline experience""",R Morten,United States,2023-12-09,Worst airline experience ever. More or bett...,Couple Leisure,Economy Class,Vienna to Newark,November 2023,no,NaN,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,670,2012-12-30,5.0,10.0,Austrian Airlines customer review,W Staab,United States,2012-12-30,JFK-Vienna-JFK. The seat space on the 777 in e...,NaN,Economy Class,NaN,NaN,NaN,NaN,NaN
700,700,2012-07-25,1.0,10.0,Austrian Airlines customer review,J Sawhney,United States,2012-07-25,One of the worst airlines I have flown. The pl...,NaN,Economy Class,NaN,NaN,no,NaN,NaN
721,721,2012-05-08,9.0,10.0,Austrian Airlines customer review,Michael Bernlohr,United States,2012-05-08,SJJ-VIE-IAD. All flights were good and on-time...,NaN,Economy Class,NaN,NaN,NaN,NaN,NaN
738,738,2012-01-10,8.0,10.0,Austrian Airlines customer review,S Azizo,United States,2012-01-10,VIE to JFK twice in less than a month. First w...,NaN,Economy Class,NaN,NaN,NaN,NaN,NaN
742,742,2011-11-23,9.0,10.0,Austrian Airlines customer review,Tim Pfister,United States,2011-11-23,I routinely commute between Vienna and New Yor...,NaN,Economy Class,NaN,NaN,NaN,NaN,NaN

0       United States
1       United States
2         Switzerland
3      Czech Republic
4      United Kingdom
            ...
742     United States
743            Canada
744           Austria
745       Switzerland
746          Thailand
Name: Country, Length: 747, dtype: object

In [21]:
import pandas as pd

In [ ]:
s=pd.Series([1,2,3])
df=pd.DataFrame(np.array([[1,2],[3,4],[5,6]]), index=s, columns=list("AB"))
print(df)

   A  B
1  1  2
2  3  4
3  5  6

In [8]:
df = pd.read_csv("C:\\Users\\Administrator\\Downloads\\archive (1)\\job_placement.csv")
df

,id,name,gender,age,degree,stream,college_name,placement_status,salary,gpa,years_of_experience
0,1,John Doe,Male,25,Bachelor's,Computer Science,Harvard University,Placed,60000,3.7,2.0
1,2,Jane Smith,Female,24,Bachelor's,Electrical Engineering,Massachusetts Institute of Technology,Placed,65000,3.6,1.0
2,3,Michael Johnson,Male,26,Bachelor's,Mechanical Engineering,Stanford University,Placed,58000,3.8,3.0
3,4,Emily Davis,Female,23,Bachelor's,Information Technology,Yale University,Not Placed,0,3.5,2.0
4,5,David Brown,Male,24,Bachelor's,Computer Science,Princeton University,Placed,62000,3.9,2.0
...,...,...,...,...,...,...,...,...,...,...,...
695,696,Lucas Taylor,Male,23,Bachelor's,Computer Science,University of Washington,Placed,67000,3.8,3.0
696,697,Emma Martinez,Female,26,Bachelor's,Electronics and Communication,University of California--Berkeley,Placed,66000,3.9,3.0
697,698,Aiden Davis,Male,24,Bachelor's,Computer Science,University of Illinois--Urbana-Champaign,Placed,65000,3.8,3.0
698,699,Mia Wilson,Female,23,Bachelor's,Electrical Engineering,University of Colorado--Boulder,Placed,66000,3.7,2.0
699,700,Jack Garcia,Male,26,Bachelor's,Information Technology,University of North Carolina--Chapel Hill,Not Placed,0,3.6,1.0

In [ ]:
len(df.loc[(df.gender=='Female') & (df.placement_status == 'Not Placed')]) / len(df.loc[(df.gender=='Female')])

0.1721311475409836

In [ ]:
len(df.loc[(df.gender=='Male') & (df.placement_status == 'Not Placed')]) / len(df.loc[(df.gender=='Male')])

0.20059880239520958

In [ ]:
# do males earn higer than women ?



df.loc[(df.gender =='Male')].salary.sum() / len(df.loc[(df.gender == 'Male')])

51458.08383233533

In [ ]:
for i in df.stream.unique():
    print(i,df.loc[(df.stream==i)].salary.sum() / len(df.loc[(df.stream== i)]))

Computer Science 48359.81308411215
Electrical Engineering 51544.642857142855
Mechanical Engineering 52180.18018018018
Information Technology 54407.89473684211
Electronics and Communication 58990.99099099099

In [ ]:
#which stream earn the most ?
stream_salaries = df.groupby('stream')['salary'].sum()

highest_earning_stream = stream_salaries.idxmax()
highest_earning_salary = stream_salaries.max()


print(highest_earning_stream)
print(highest_earning_salary)

print(f"the stream {highest_earning_stream} earns highest salary is {highest_earning_salary}")

Computer Science
10349000
the stream Computer Science earns highest salary is 10349000

In [ ]:

stream_salaries = df.groupby('stream')['salary'].sum()

df.loc[(df.gender =='Female')]

best_stream_for_women = stream_salaries.idxmax()
best_stream_avg_salary = stream_salaries.max()
print(stream_salaries)
print(best_stream_for_women)
print(best_stream_avg_salary)

print(f"The best stream for women is '{best_stream_for_women}' with an highest salary of {best_stream_avg_salary}.")

(a)
df

stream
Computer Science                 10349000
Electrical Engineering            5773000
Electronics and Communication     6548000
Information Technology            8270000
Mechanical Engineering            5792000
Name: salary, dtype: int64
Computer Science
10349000
The best stream for women is 'Computer Science' with an highest salary of 10349000.

,id,name,gender,age,degree,stream,college_name,placement_status,salary,gpa,years_of_experience
0,1,John Doe,Male,25,Bachelor's,Computer Science,Harvard University,Placed,60000,3.7,2.0
1,2,Jane Smith,Female,24,Bachelor's,Electrical Engineering,Massachusetts Institute of Technology,Placed,65000,3.6,1.0
2,3,Michael Johnson,Male,26,Bachelor's,Mechanical Engineering,Stanford University,Placed,58000,3.8,3.0
3,4,Emily Davis,Female,23,Bachelor's,Information Technology,Yale University,Not Placed,0,3.5,2.0
4,5,David Brown,Male,24,Bachelor's,Computer Science,Princeton University,Placed,62000,3.9,2.0
...,...,...,...,...,...,...,...,...,...,...,...
695,696,Lucas Taylor,Male,23,Bachelor's,Computer Science,University of Washington,Placed,67000,3.8,3.0
696,697,Emma Martinez,Female,26,Bachelor's,Electronics and Communication,University of California--Berkeley,Placed,66000,3.9,3.0
697,698,Aiden Davis,Male,24,Bachelor's,Computer Science,University of Illinois--Urbana-Champaign,Placed,65000,3.8,3.0
698,699,Mia Wilson,Female,23,Bachelor's,Electrical Engineering,University of Colorado--Boulder,Placed,66000,3.7,2.0
699,700,Jack Garcia,Male,26,Bachelor's,Information Technology,University of North Carolina--Chapel Hill,Not Placed,0,3.6,1.0

In [ ]:


for Female in df.groupby('gender'):
    
    print(Female)

('Female',       id               name  gender  age      degree  \
1      2         Jane Smith  Female   24  Bachelor's
3      4        Emily Davis  Female   23  Bachelor's
5      6       Sarah Wilson  Female   25  Bachelor's
7      8        Emma Garcia  Female   24  Bachelor's
9     10  Samantha Anderson  Female   23  Bachelor's
..   ...                ...     ...  ...         ...
690  691            Ava Lee  Female   24  Bachelor's
692  693  Isabella Martinez  Female   23  Bachelor's
694  695     Sophia Johnson  Female   24  Bachelor's
696  697      Emma Martinez  Female   26  Bachelor's
698  699         Mia Wilson  Female   23  Bachelor's

                            stream                             college_name  \
1           Electrical Engineering    Massachusetts Institute of Technology
3           Information Technology                          Yale University
5    Electronics and Communication                      Columbia University
7                 Computer Science                    University of Chicago
9           Mechanical Engineering                  Northwestern University
..                             ...                                      ...
690         Information Technology  University of California--San Francisco
692  Electronics and Communication                   University of Virginia
694         Mechanical Engineering               University of Pennsylvania
696  Electronics and Communication       University of California--Berkeley
698         Electrical Engineering          University of Colorado--Boulder

    placement_status  salary  gpa  years_of_experience
1             Placed   65000  3.6                  1.0
3         Not Placed       0  3.5                  2.0
5             Placed   63000  3.7                  1.0
7         Not Placed       0  3.6                  2.0
9             Placed   57000  3.5                  1.0
..               ...     ...  ...                  ...
690           Placed   66000  3.8                  3.0
692           Placed   64000  3.9                  2.0
694       Not Placed       0  3.7                  2.0
696           Placed   66000  3.9                  3.0
698           Placed   66000  3.7                  2.0

[366 rows x 11 columns])
('Male',       id              name gender  age      degree                  stream  \
0      1          John Doe   Male   25  Bachelor's        Computer Science
2      3   Michael Johnson   Male   26  Bachelor's  Mechanical Engineering
4      5       David Brown   Male   24  Bachelor's        Computer Science
6      7    James Martinez   Male   26  Bachelor's  Information Technology
8      9  Alexander Taylor   Male   25  Bachelor's  Electrical Engineering
..   ...               ...    ...  ...         ...                     ...
691  692        Liam Perez   Male   25  Bachelor's        Computer Science
693  694     Alexander Lee   Male   26  Bachelor's  Information Technology
695  696      Lucas Taylor   Male   23  Bachelor's        Computer Science
697  698       Aiden Davis   Male   24  Bachelor's        Computer Science
699  700       Jack Garcia   Male   26  Bachelor's  Information Technology

                                  college_name placement_status  salary  gpa  \
0                           Harvard University           Placed   60000  3.7
2                          Stanford University           Placed   58000  3.8
4                         Princeton University           Placed   62000  3.9
6           California Institute of Technology           Placed   59000  3.8
8                   University of Pennsylvania           Placed   64000  3.7
..                                         ...              ...     ...  ...
691                University of Texas--Dallas           Placed   63000  3.6
693          University of Michigan--Ann Arbor           Placed   67000  3.9
695                   University of Washington           Placed   67000  3.8
697   University of Illinois--Urbana-Champaign           Placed   65000  3.8
699  University of North Carolina--Chapel Hill       Not Placed       0  3.6

     years_of_experience
0                    2.0
2                    3.0
4                    2.0
6                    3.0
8                    2.0
..                   ...
691                  1.0
693                  3.0
695                  3.0
697                  3.0
699                  1.0

[334 rows x 11 columns])

In [9]:

df.loc[(df.gender =='Female')].salary.sum() / len(df.loc[(df.gender == 'Female')]) 
df

,id,name,gender,age,degree,stream,college_name,placement_status,salary,gpa,years_of_experience
0,1,John Doe,Male,25,Bachelor's,Computer Science,Harvard University,Placed,60000,3.7,2.0
1,2,Jane Smith,Female,24,Bachelor's,Electrical Engineering,Massachusetts Institute of Technology,Placed,65000,3.6,1.0
2,3,Michael Johnson,Male,26,Bachelor's,Mechanical Engineering,Stanford University,Placed,58000,3.8,3.0
3,4,Emily Davis,Female,23,Bachelor's,Information Technology,Yale University,Not Placed,0,3.5,2.0
4,5,David Brown,Male,24,Bachelor's,Computer Science,Princeton University,Placed,62000,3.9,2.0
...,...,...,...,...,...,...,...,...,...,...,...
695,696,Lucas Taylor,Male,23,Bachelor's,Computer Science,University of Washington,Placed,67000,3.8,3.0
696,697,Emma Martinez,Female,26,Bachelor's,Electronics and Communication,University of California--Berkeley,Placed,66000,3.9,3.0
697,698,Aiden Davis,Male,24,Bachelor's,Computer Science,University of Illinois--Urbana-Champaign,Placed,65000,3.8,3.0
698,699,Mia Wilson,Female,23,Bachelor's,Electrical Engineering,University of Colorado--Boulder,Placed,66000,3.7,2.0
699,700,Jack Garcia,Male,26,Bachelor's,Information Technology,University of North Carolina--Chapel Hill,Not Placed,0,3.6,1.0

In [ ]:
# which stream is the best for the women ?

import pandas as pd

women=df.loc[(df.gender =='Female')]
stream_salaries = women.groupby('stream')['salary'].sum()
best_stream_for_women = stream_salaries.idxmax()
stream_max_salary = stream_salaries.max()
#print(best_stream_for_women)  
#print(stream_max_salary)



print(f"The best stream for women is {best_stream_for_women} with an a highest salary with {stream_max_salary}")

Electronics and Communication
6023000
The best stream for women is Electronics and Communication with an a highest salary with 6023000

In [22]:


female_df = df[df['gender'] == 'Female']
stream_salaries = female_df.groupby('stream')['salary'].mean()
b=df.groupby('stream')['salary'].std()
print(b)
print(stream_salaries-b)
#print(f"The best stream for women is '{best_stream_for_women}' with an highest salary of {best_stream_avg_salary}.")

stream
Computer Science                 27878.112841
Electrical Engineering           25673.938970
Electronics and Communication    18743.966542
Information Technology           23730.092462
Mechanical Engineering           25423.753459
Name: salary, dtype: float64
stream
Computer Science                 16969.713246
Electrical Engineering           26752.727697
Electronics and Communication    40305.053066
Information Technology           31367.468514
Mechanical Engineering           26223.305364
Name: salary, dtype: float64

In [20]:
(stream_salaries- b).sort_values(ascending=False)

stream
Electronics and Communication    40305.053066
Information Technology           31367.468514
Electrical Engineering           26752.727697
Mechanical Engineering           26223.305364
Computer Science                 16969.713246
Name: salary, dtype: float64

In [23]:
(b).sort_values(ascending=False)

stream
Computer Science                 27878.112841
Electrical Engineering           25673.938970
Mechanical Engineering           25423.753459
Information Technology           23730.092462
Electronics and Communication    18743.966542
Name: salary, dtype: float64